www/templates/SwitchRole.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:localhost-paint" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:handleRequest>
			<contextId xsi:type="xsd:string">01234567890</contextId>
			<className xsi:type="xsd:string">bus_facade_context</className>
			<processName xsi:type="xsd:string">switchRole</processName>
			<entityData xsi:type="ns2:Map">
				<item>
                   <key xsi:type="xsd:string">currentRoleKey</key>
                   <value xsi:nil="true"/>
				</item>
				</entityData>
			<processData xsi:type="ns2:Map"/>
		</ns1:handleRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
